// Реалізувати програму на Javascript, яка буде знаходити всі числа кратні 5 (діляться на 5 без залишку)
// у заданому діапазоні.

// - Висести за допомогою модального вікна браузера число, яке введе користувач.
// - Вивести в консолі усі числа кратні 5, від 0 до введеного користувачем числа.
// Якщо таких чисел немає - вивести в консоль фразу Sorry, no numbers
// - Обов'язково необхідно використовувати синтаксис ES6 (ES2015) для створення змінних.
// - Перевірити, чи введене значення є цілим числом. Якщо ця умова не дотримується,
// повторювати виведення вікна на екран, доки не буде введено ціле число.

// - Вважати два числа, m та n. Вивести в консоль усі прості числа
// (http://ua.math.wikia.com/wiki/%D0%9F%D1%80%D0%BE%D1%81%D1%82%D0%BE%D0%B5_% D1%87%D0%B8%D1%81%D0%BB%D0%BE)
//  в діапазоні від m до n (менше з введених чисел буде m, більше буде `n`).
// Якщо хоча б одне з чисел не дотримується умови валідації, вказаної вище, вивести повідомлення
// про помилку і запитати обидва числа заново.

// ----------------------------------------------------------------

let number = parseFloat(prompt("Введите число"));

if (Number.isInteger(number)) {
  result = true;
  alert (`Вы ввели число ${number}`);
  console.log(`Введено число ${number}`);
} else {
  result = false;
  number = parseFloat(prompt("Введите целое число"));
  alert (`Вы ввели число ${number}`);
  console.log(`Введено число ${number}`);
}

for (let i = 0; i <= number; i++) {
  if (i % 5 === 0 && i > 0) {
    console.log(i);
  }
  if (number < 5) {
    console.log(`Sorry, no numbers`);
  }
}
// -----------------------------------------------------------------

let m;
let n;

do {
  m = parseInt(prompt("Введите число", 0));
} while (m > n && m != null);

do {
  n = parseInt(prompt("Введите ещё одно число", 0));
} while (n < m && n != null);

alert(`Диапазон для вычисления от ${m} до ${n}`);

console.log(`Диапазон для вычисления простых чисел от ${m} до ${n}`);

nextPrime: 
for (let i = m; i <= n; i++) {
  for (let j = 2; j < i; j++) {
    if (i % j == 0) 
    continue nextPrime;
  }
  console.log(i);
}
